<a href="https://colab.research.google.com/github/bmt202121414/bmt_python/blob/main/21414_10%EC%A3%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [8]:
row = pd.date_range('20210507', periods=6)
col = list('ABCD')
df = pd.DataFrame(np.random.randn(6,4),index=row, columns=col)

In [9]:
df

                   A         B         C         D
2021-05-07 -0.400063  1.484314 -0.181211  1.407233
2021-05-08  0.912445  0.742802  0.009462 -0.181393
2021-05-09 -0.338521 -0.083245  1.037855  1.887871
2021-05-10 -1.394345  1.057487  1.228240 -0.837828
2021-05-11  1.897772 -1.219331 -0.489267  0.177021
2021-05-12 -0.331907  0.317568  0.326509  0.052806

In [11]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20210507', periods=6))

In [12]:
df['F'] = s1

In [13]:
df

                   A         B         C         D  F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233  1
2021-05-08  0.912445  0.742802  0.009462 -0.181393  2
2021-05-09 -0.338521 -0.083245  1.037855  1.887871  3
2021-05-10 -1.394345  1.057487  1.228240 -0.837828  4
2021-05-11  1.897772 -1.219331 -0.489267  0.177021  5
2021-05-12 -0.331907  0.317568  0.326509  0.052806  6

In [14]:
df>0

                A      B      C      D     F
2021-05-07  False   True  False   True  True
2021-05-08   True   True   True  False  True
2021-05-09  False  False   True   True  True
2021-05-10  False   True   True  False  True
2021-05-11   True  False  False   True  True
2021-05-12  False   True   True   True  True

In [15]:
df[df>0]

                   A         B         C         D  F
2021-05-07       NaN  1.484314       NaN  1.407233  1
2021-05-08  0.912445  0.742802  0.009462       NaN  2
2021-05-09       NaN       NaN  1.037855  1.887871  3
2021-05-10       NaN  1.057487  1.228240       NaN  4
2021-05-11  1.897772       NaN       NaN  0.177021  5
2021-05-12       NaN  0.317568  0.326509  0.052806  6

In [16]:
df2=df.copy()

In [17]:
df2

                   A         B         C         D  F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233  1
2021-05-08  0.912445  0.742802  0.009462 -0.181393  2
2021-05-09 -0.338521 -0.083245  1.037855  1.887871  3
2021-05-10 -1.394345  1.057487  1.228240 -0.837828  4
2021-05-11  1.897772 -1.219331 -0.489267  0.177021  5
2021-05-12 -0.331907  0.317568  0.326509  0.052806  6

In [18]:
df2[df2>0]

                   A         B         C         D  F
2021-05-07       NaN  1.484314       NaN  1.407233  1
2021-05-08  0.912445  0.742802  0.009462       NaN  2
2021-05-09       NaN       NaN  1.037855  1.887871  3
2021-05-10       NaN  1.057487  1.228240       NaN  4
2021-05-11  1.897772       NaN       NaN  0.177021  5
2021-05-12       NaN  0.317568  0.326509  0.052806  6

In [20]:
df2[df2>0] = -df

In [21]:
df2

                   A         B         C         D  F
2021-05-07 -0.400063 -1.484314 -0.181211 -1.407233 -1
2021-05-08 -0.912445 -0.742802 -0.009462 -0.181393 -2
2021-05-09 -0.338521 -0.083245 -1.037855 -1.887871 -3
2021-05-10 -1.394345 -1.057487 -1.228240 -0.837828 -4
2021-05-11 -1.897772 -1.219331 -0.489267 -0.177021 -5
2021-05-12 -0.331907 -0.317568 -0.326509 -0.052806 -6

In [22]:
df

                   A         B         C         D  F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233  1
2021-05-08  0.912445  0.742802  0.009462 -0.181393  2
2021-05-09 -0.338521 -0.083245  1.037855  1.887871  3
2021-05-10 -1.394345  1.057487  1.228240 -0.837828  4
2021-05-11  1.897772 -1.219331 -0.489267  0.177021  5
2021-05-12 -0.331907  0.317568  0.326509  0.052806  6

In [23]:
df.mean()

A    0.057564
B    0.383266
C    0.321931
D    0.417618
F    3.500000
dtype: float64

In [24]:
df.mean(1)

2021-05-07    0.662055
2021-05-08    0.696663
2021-05-09    1.100792
2021-05-10    0.810711
2021-05-11    1.073239
2021-05-12    1.272995
Freq: D, dtype: float64

In [27]:
print(df.apply(np.cumsum));print() # 데이터에 함수를 적용
# np.cumsum : 배열에서 주어진 축에 따라 누적되는 원소들의 누적 합을 계산하는 함수

print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용
df.apply(np.cumsum)

                   A         B         C         D   F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233   1
2021-05-08  0.512382  2.227116 -0.171749  1.225840   3
2021-05-09  0.173861  2.143871  0.866106  3.113711   6
2021-05-10 -1.220483  3.201358  2.094347  2.275883  10
2021-05-11  0.677288  1.982027  1.605080  2.452904  15
2021-05-12  0.345382  2.299595  1.931588  2.505710  21

A    3.292117
B    2.703645
C    1.717508
D    2.725698
F    5.000000
dtype: float64

                   A         B         C         D   F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233   1
2021-05-08  0.512382  2.227116 -0.171749  1.225840   3
2021-05-09  0.173861  2.143871  0.866106  3.113711   6
2021-05-10 -1.220483  3.201358  2.094347  2.275883  10
2021-05-11  0.677288  1.982027  1.605080  2.452904  15
2021-05-12  0.345382  2.299595  1.931588  2.505710  21

In [28]:
df

                   A         B         C         D  F
2021-05-07 -0.400063  1.484314 -0.181211  1.407233  1
2021-05-08  0.912445  0.742802  0.009462 -0.181393  2
2021-05-09 -0.338521 -0.083245  1.037855  1.887871  3
2021-05-10 -1.394345  1.057487  1.228240 -0.837828  4
2021-05-11  1.897772 -1.219331 -0.489267  0.177021  5
2021-05-12 -0.331907  0.317568  0.326509  0.052806  6

In [29]:
df.apply(np.cumsum,axis=1)

                   A         B         C         D         F
2021-05-07 -0.400063  1.084251  0.903040  2.310273  3.310273
2021-05-08  0.912445  1.655247  1.664709  1.483316  3.483316
2021-05-09 -0.338521 -0.421765  0.616090  2.503960  5.503960
2021-05-10 -1.394345 -0.336858  0.891383  0.053555  4.053555
2021-05-11  1.897772  0.678441  0.189174  0.366194  5.366194
2021-05-12 -0.331907 -0.014339  0.312170  0.364976  6.364976

In [30]:
print(df.apply(lambda x: x.max() - x.min())) # 행에 대해 함수 적용

A    3.292117
B    2.703645
C    1.717508
D    2.725698
F    5.000000
dtype: float64

In [31]:
lambda X : X.max() - X.min()

In [33]:
lambda df : df.max() - df.min()

In [34]:
df.apply(lambda x: x.max() - x.min())

A    3.292117
B    2.703645
C    1.717508
D    2.725698
F    5.000000
dtype: float64

In [48]:
s = pd.Series(np.random.randint(0, 7, size = 10))
print(s);print()
print(s.value_counts()) # 유일한 값별 개수 세기

0    6
1    5
2    6
3    6
4    1
5    5
6    3
7    2
8    1
9    4
dtype: int64

6    3
5    2
1    2
4    1
3    1
2    1
dtype: int64

In [50]:
s = pd.Series(np.random.randint(1,7, size = 6000))
s.value_counts()

3    1010
2    1008
4    1000
1     998
6     996
5     988
dtype: int64

In [51]:
df = pd.DataFrame(np.random.randn(10,4))

In [52]:
df

          0         1         2         3
0 -0.523558  0.218859 -1.382579  0.678105
1  1.874234  0.298117 -1.684565  1.267656
2 -0.174418 -1.144266 -0.680292 -0.358086
3 -0.503012  1.063845  0.896663  1.279488
4 -0.026284 -0.677828  0.492000 -1.414656
5  0.067250 -0.624380  0.617449  0.534373
6 -1.291327 -1.870633 -0.121270 -0.980187
7 -0.445217  0.041881 -1.636371  0.115462
8 -0.353522 -0.839786  0.417259  0.543908
9  0.747200  0.685569  0.619976 -0.026316

In [57]:
pieces = [df[:3], df[3:7], df[7:]]

In [58]:
pieces

[          0         1         2         3
 0 -0.523558  0.218859 -1.382579  0.678105
 1  1.874234  0.298117 -1.684565  1.267656
 2 -0.174418 -1.144266 -0.680292 -0.358086,
           0         1         2         3
 3 -0.503012  1.063845  0.896663  1.279488
 4 -0.026284 -0.677828  0.492000 -1.414656
 5  0.067250 -0.624380  0.617449  0.534373
 6 -1.291327 -1.870633 -0.121270 -0.980187,
           0         1         2         3
 7 -0.445217  0.041881 -1.636371  0.115462
 8 -0.353522 -0.839786  0.417259  0.543908
 9  0.747200  0.685569  0.619976 -0.026316]

In [59]:
pd.concat(pieces)

          0         1         2         3
0 -0.523558  0.218859 -1.382579  0.678105
1  1.874234  0.298117 -1.684565  1.267656
2 -0.174418 -1.144266 -0.680292 -0.358086
3 -0.503012  1.063845  0.896663  1.279488
4 -0.026284 -0.677828  0.492000 -1.414656
5  0.067250 -0.624380  0.617449  0.534373
6 -1.291327 -1.870633 -0.121270 -0.980187
7 -0.445217  0.041881 -1.636371  0.115462
8 -0.353522 -0.839786  0.417259  0.543908
9  0.747200  0.685569  0.619976 -0.026316

In [66]:
left = pd.DataFrame(
    {
        'a':['foo', 'foo'], 
        'lval': [1, 2]
     }
)
right = pd.DataFrame({'a':['foo', 'foo'], 'rval': [4, 5]})

In [67]:
left

     a  lval
0  foo     1
1  foo     2

In [68]:
left,right

(     a  lval
 0  foo     1
 1  foo     2,      a  rval
 0  foo     4
 1  foo     5)

In [69]:
right

     a  rval
0  foo     4
1  foo     5

In [70]:
pd.merge(left, right, on = 'a')

     a  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [72]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    }
)

In [73]:
df

     A      B         C         D
0  foo    one  0.209815  0.266780
1  bar    one -0.763448  1.228908
2  foo    two -0.725868 -0.442986
3  bar  three -0.963164 -0.298762
4  foo    two -1.466465 -0.346661
5  bar    two -0.110534  0.308004
6  foo    one  0.223323  0.181774
7  bar  three  0.504988  0.065644

In [83]:
a = df.groupby('A').sum()
a

            C         D
A
bar -1.332158  1.303793
foo -1.759195 -0.341093

In [88]:
a = df.groupby(['A','B']).sum()
a

                  C         D
A   B
bar one   -0.763448  1.228908
    three -0.458176 -0.233118
    two   -0.110534  0.308004
foo one    0.433139  0.448554
    two   -2.192333 -0.789647

In [77]:
x = [1,2,3]
y = [4,5,6]
zipped = zip(x,y)
list(zipped)

[(1, 4), (2, 5), (3, 6)]

In [78]:
x2, y2 = zip(*zip(x,y))

In [79]:
x2

(1, 2, 3)

In [80]:
y2

(4, 5, 6)

In [81]:
x

[1, 2, 3]

In [90]:
list(zipped)

[]

In [91]:
df = pd.DataFrame(
    {
        'A' : ['one', 'one', 'two', 'three'] * 3,
        'B' : ['A', 'B', 'C'] * 4,
        'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar' ] * 2,
        'D' : np.random.randn(12),
        'E' : np.random.randn(12)
    }
)

In [93]:
df

        A  B    C         D         E
0     one  A  foo  0.504223 -0.718366
1     one  B  foo  0.797664 -1.398788
2     two  C  foo  0.739493  0.514978
3   three  A  bar -1.054360  1.200778
4     one  B  bar -1.264879  0.578592
5     one  C  bar -0.428840 -0.029469
6     two  A  foo  0.266737 -0.851063
7   three  B  foo -0.036502  0.003492
8     one  C  foo  1.363782  0.398591
9     one  A  bar  0.527500 -0.129872
10    two  B  bar  0.009234  0.142998
11  three  C  bar  0.293021  1.266069

In [94]:
pd.pivot_table(df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  0.527500  0.504223
      B -1.264879  0.797664
      C -0.428840  1.363782
three A -1.054360       NaN
      B       NaN -0.036502
      C  0.293021       NaN
two   A       NaN  0.266737
      B  0.009234       NaN
      C       NaN  0.739493